print("----คำนวณค่าดัชนีมวลกาย-----")
x = float(input("น้ำหนักตัว: "))
y = float(input("ส่วนสูง: "))
t = (y/100)**2
p = x/t
print("ค่าดัชนีมวลกายคือ %.2f" %p)
if p < 18.50 :
    print("น้ำหนักน้อย/ผอม")
elif p >=18.50 and y <=22.90 :
    print("---ปกติสุขภาพดี---")
elif p >=23 and y <=24.90 :
    print("---ท้วม/โรคอ้วนระดับ 1 ---")
elif p >=25 and y <=29.90 :
    print("---อ้วน/โรคอ้วนระดับ 2---")
elif p >=30 :
    print("---อ้วนมาก/โรคอ้วนระดับ 3---")
else : print("----ใส่น้ำหนักส่วนสูงสลับกันรึเปล่า----")